{
    "criterios": {
        "ambigüedades": [
            "rápido",
            "fácil",
            "mejorar",
            "simple",
            "intuitivo",
            "óptimo",
            "cómodo",
            "moderno",
            "innovador",
            "inteligente",
            "profesional"
        ],
        "métricas": [
            "transacciones",
            "usuarios",
            "por segundo",
            "tiempo de respuesta",
            "tiempo medio de respuesta",
            "latencia",
            "latencia pico",
            "conexiones simultáneas",
            "procesos concurrentes",
            "peticiones por minuto",
            "tasa de compresión",
            "unidades procesadas por minuto",
            "errores por hora",
            "tasa de errores por segundo",
            "número de peticiones fallidas",
            "porcentaje de disponibilidad",
            "tiempo de inactividad (downtime)",
            "tiempo medio de recuperación (MTTR)",
            "tiempo medio entre fallas (MTBF)",
            "rendimiento",
            "throughput",
            "carga",
            "uso de CPU",
            "uso de memoria",
            "eficiencia de memoria",
            "milisegundo",
            "milisegundos por operación",
            "bps",
            "tiempo de despliegue",
            "tolerancia a fallas",
            "porcentaje de aciertos",
            "tiempo de ejecución",
            "coste por operación",
            "tiempo medio de implementación"
        ],
        "palabras_informales": [
            "quiero",
            "necesito",
            "opino",
            "no estoy seguro",
            "me gustaría",
            "pienso",
            "preferiría",
            "tal vez",
            "podría",
            "creo que",
            "siento que",
            "es posible",
            "a lo mejor",
            "supongo",
            "quizás",
            "imagino que",
            "sería bueno",
            "porfa",
            "deseo",
            "estimo"
        ]
    },
    "conectores_validos": [
        "debe",
        "debería",
        "tendrá que",
        "tendría que",
        "ha de",
        "es necesario que",
        "se requiere que",
        "es obligatorio que",
        "se espera que",
        "ha sido diseñado para",
        "está previsto que",
        "es imperativo que",
        "se estipula que"
    ],
    "prefijos_validos": [
        "El sistema",
        "La aplicación",
        "La plataforma",
        "El software",
        "El módulo",
        "El componente",
        "La interfaz",
        "El servicio",
        "La herramienta",
        "La solución",
        "El subsistema",
        "El framework",
        "El entorno",
        "El programa"
    ],
    "requisitos_no_ideales": [
        "Quiero que el sistema sea fácil de usar y rápido.",
        "El sistema debe mejorar la eficiencia operativa de manera satisfactoria.",
        "La aplicación debe ser moderna y soportar grandes volúmenes de datos.",
        "El software debe ser fácil de instalar y configurar.",
        "La interfaz de usuario debe ser amigable y atractiva.",
        "El sistema debería ser bastante rápido y fácil de usar.",
        "Necesito que la aplicación soporte muchas características interesantes.",
        "La plataforma debería funcionar bien en diferentes dispositivos.",
        "Quiero que los usuarios tengan una buena experiencia usando la aplicación.",
        "La aplicación debería integrarse con otras herramientas fácilmente.",
        "El sistema necesita ser más eficiente y más seguro.",
        "La interfaz de usuario debe ser agradable y sencilla de navegar.",
        "La aplicación debería ser más intuitiva para los nuevos usuarios.",
        "Queremos que el software tenga una interfaz moderna y atractiva.",
        "El sistema debe funcionar sin problemas y sin errores.",
        "El sistema debe ser intuitivo para cualquier tipo de usuario.",
        "La plataforma debería ser completamente confiable y no fallar nunca.",
        "La aplicación debe ser la mejor en el mercado.",
        "El software debería ser capaz de manejar cualquier cantidad de usuarios simultáneamente.",
        "Queremos que el sistema sea altamente personalizable para cada usuario.",
        "El sistema debería resolver todos los problemas de los usuarios automáticamente.",
        "La solución debe ser innovadora y estar a la vanguardia de la tecnología.",
        "El diseño debe ser atractivo para todo tipo de audiencias.",
        "El sistema debería satisfacer las expectativas de los usuarios en todo momento.",
        "La aplicación debe responder instantáneamente a cualquier acción del usuario.",
        "El sistema debe ser compatible con cualquier tecnología existente o futura.",
        "El software debe ser económico pero con características de alta gama.",
        "La solución debe superar a todas las aplicaciones similares en el mercado.",
        "Queremos que los usuarios sientan que el sistema es exactamente lo que necesitan.",
        "La aplicación debe adaptarse automáticamente a cualquier situación o necesidad.",
        "El sistema debería ser tan sencillo que no requiera manual de usuario.",
        "El software debe ser totalmente flexible y escalar sin límites.",
        "La interfaz debe impresionar a los usuarios desde el primer uso.",
        "El sistema debería ser accesible para todos, sin importar sus habilidades tecnológicas.",
        "La aplicación debe recibir críticas positivas de todos los usuarios.",
        "El software debe mantener la atención del usuario y ser divertido de usar.",
        "El sistema debería eliminar cualquier frustración del usuario.",
        "Queremos que la aplicación sea más eficiente que cualquier otra en el mercado.",
        "El software debería anticiparse a las necesidades del usuario.",
        "El sistema debe ser desarrollado rápidamente pero con alta calidad.",
        "La solución debe estar preparada para cualquier desafío del futuro.",
        "El diseño debe ser único y diferente a cualquier cosa existente.",
        "El sistema debería cumplir con cualquier normativa o regulación aplicable, presente o futura.",
        "La aplicación debe mejorar la productividad del usuario sin requerir esfuerzo adicional.",
        "El software debe ser perfectamente compatible con todas las plataformas."
    ],
    "ejemplos_ideales": [
        "El sistema debe permitir realizar búsquedas avanzadas con filtros por nombre, fecha y categoría, respondiendo en menos de 1 segundo.",
        "El sistema debe proporcionar informes mensuales en formato PDF, generados en menos de 30 segundos para bases de datos con hasta 1 millón de registros.",
        "El sistema debe garantizar que el tiempo máximo de inactividad no supere los 30 minutos al mes, asegurando alta disponibilidad.",
        "El sistema debe soportar múltiples idiomas, incluyendo inglés, español, francés y alemán, con la capacidad de añadir nuevos idiomas en menos de 5 días.",
        "El sistema debe enviar alertas automáticas a través de SMS y correo electrónico si el uso de CPU supera el 80% durante más de 5 minutos.",
        "El sistema debe procesar y almacenar videos de hasta 1 GB utilizando codificación H.264, reduciendo el tamaño en un 50% sin pérdida significativa de calidad.",
        "El sistema debe permitir la integración con sistemas ERP utilizando APIs RESTful con un tiempo de respuesta inferior a 100 milisegundos.",
        "El sistema debe ofrecer autenticación multifactor (MFA) utilizando aplicaciones móviles o mensajes SMS para todos los usuarios.",
        "El sistema debe auditar automáticamente todas las operaciones críticas, generando logs que cumplan con el estándar ISO 27001.",
        "El sistema debe soportar hasta 100 transacciones bancarias por segundo, con cumplimiento total de las normativas PSD2.",
        "El sistema debe proporcionar acceso sin interrupciones a datos almacenados en caché cuando el servidor principal no esté disponible.",
        "El sistema debe validar formularios en el lado cliente y servidor, asegurando que los datos cumplan con los estándares definidos antes de ser procesados.",
        "El sistema debe permitir la exportación de datos en formatos CSV, XLSX y JSON con soporte para archivos de hasta 10 millones de filas.",
        "El sistema debe gestionar permisos y roles de usuarios con gran granularidad, soportando hasta 50 niveles de acceso diferentes.",
        "El sistema debe ser compatible con navegadores modernos, incluyendo Chrome, Firefox, Safari y Edge, en sus versiones actuales y anteriores.",
        "El sistema debe implementar un mecanismo de recuperación automática que reinicie servicios fallidos en menos de 1 minuto.",
        "El sistema debe generar alertas automáticas para errores críticos en menos de 10 segundos después de ser detectados.",
        "El sistema debe procesar datos en tiempo real para alimentar un tablero de control actualizado con una latencia máxima de 2 segundos.",
        "El sistema debe permitir realizar copias de seguridad completas diarias, asegurando una restauración completa en menos de 30 minutos.",
        "El sistema debe permitir la edición colaborativa de documentos en tiempo real, con soporte para hasta 20 usuarios simultáneos.",
        "El sistema debe mantener la trazabilidad de los requisitos y relacionarlos con casos de uso específicos, facilitando la auditoría.",
        "El sistema debe tolerar al menos una caída de nodo en un entorno distribuido, garantizando la continuidad de servicio.",
        "El sistema debe procesar peticiones mediante cola de mensajes para asegurar que la latencia promedio no exceda los 200 milisegundos.",
        "El sistema debe integrar un sistema de almacenamiento caché distribuido que permita atenuar picos de tráfico de hasta 50,000 usuarios concurrentes.",
        "El sistema debe registrar automáticamente cada modificación de datos en un historial, incluyendo la fecha, la hora y el usuario que realizó el cambio.",
        "El sistema debe proveer un panel de administración con estadísticas de uso diario, promediando en tiempo real el consumo de recursos.",
        "El sistema debe incluir validaciones de campos obligatorios, formatos y rangos numéricos para todos los formularios críticos.",
        "El sistema debe registrar y cifrar todas las contraseñas de usuarios utilizando el algoritmo AES-256, garantizando un tiempo de recuperación de contraseñas menor a 60 segundos bajo solicitud autenticada.",
        "El sistema debe enviar notificaciones por correo electrónico y SMS cuando la tasa de errores supere el 0.5% en el transcurso de 10 minutos consecutivos.",
        "El sistema debe generar facturas en formato PDF en un tiempo máximo de 5 segundos, incluso con una concurrencia de hasta 50 usuarios simultáneos.",
        "El sistema debe proporcionar una API para la integración con plataformas de terceros, manteniendo un tiempo de respuesta promedio inferior a 200 milisegundos durante pruebas de estrés.",
        "El sistema debe encriptar todos los datos sensibles en reposo y en tránsito, cumpliendo con la normativa GDPR y almacenando registros de auditoría por al menos 3 años.",
        "El sistema debe ofrecer una interfaz de carga de archivos de hasta 2 GB, validando el tipo de contenido y garantizando un proceso de carga que no supere los 90 segundos.",
        "El sistema debe desplegar los cambios aprobados en un entorno de producción automatizado en menos de 10 minutos, respetando una tasa de fallos de despliegue inferior al 2%.",
        "El sistema debe permitir la configuración de políticas de retención de datos, eliminándolos de forma segura una vez transcurridos 180 días de inactividad.",
        "El sistema debe soportar la ejecución de pruebas automáticas de regresión en cada commit, asegurando un 100% de cobertura en los módulos críticos.",
        "El sistema debe permitir la creación, edición y eliminación de perfiles de usuario, garantizando roles y permisos específicos para cada categoría de usuario.",
        "La aplicación debe encriptar todos los datos sensibles utilizando el estándar AES-256 y requerir autenticación de dos factores para el acceso administrativo.",
        "El sistema debe procesar solicitudes de usuario en menos de 1 segundo y mantener un tiempo de actividad del 99.9% mensual.",
        "La interfaz debe ser responsiva, adaptándose a dispositivos móviles y de escritorio, y permitir la personalización de temas por parte del usuario.",
        "El sistema debe integrarse con la API de pagos Stripe, permitiendo transacciones seguras y manejo automático de devoluciones en tiempo real.",
        "El sistema debe permitir la creación, edición y eliminación de perfiles de usuario, garantizando roles y permisos específicos para cada categoría de usuario.",
        "La aplicación debe encriptar todos los datos sensibles utilizando el estándar AES-256 y requerir autenticación de dos factores para el acceso administrativo.",
        "El sistema debe procesar solicitudes de usuario en menos de 1 segundo y mantener un tiempo de actividad del 99.9% mensual.",
        "La interfaz debe ser responsiva, adaptándose a dispositivos móviles y de escritorio, y permitir la personalización de temas por parte del usuario.",
        "El sistema debe integrarse con la API de pagos Stripe, permitiendo transacciones seguras y manejo automático de devoluciones en tiempo real.",
        "La plataforma debe soportar al menos 10,000 usuarios concurrentes sin degradar el rendimiento, asegurando una experiencia fluida para todos los usuarios.",
        "El sistema debe generar reportes financieros mensuales en formato PDF y Excel, con opciones de filtrado por rango de fechas y categorías de gasto.",
        "La aplicación debe implementar un sistema de notificaciones en tiempo real utilizando WebSockets, informando a los usuarios sobre actualizaciones importantes.",
        "El software debe ser compatible con los navegadores Chrome, Firefox, Safari y Edge en sus últimas dos versiones, garantizando una experiencia consistente.",
        "El sistema debe realizar copias de seguridad automáticas diarias de la base de datos, almacenándolas en un servidor seguro con redundancia geográfica.",
        "La aplicación debe permitir la importación y exportación de datos en formatos CSV y JSON, facilitando la integración con otras herramientas y sistemas.",
        "El sistema debe ofrecer una funcionalidad de búsqueda avanzada, permitiendo a los usuarios filtrar resultados por múltiples criterios simultáneamente.",
        "La plataforma debe incluir un panel de administración con acceso restringido, permitiendo a los administradores gestionar usuarios, permisos y configuraciones del sistema.",
        "El software debe soportar la localización en al menos cinco idiomas, incluyendo inglés, español, francés, alemán y portugués, facilitando su uso a nivel global.",
        "La aplicación debe implementar medidas de seguridad como protección contra ataques SQL Injection y Cross-Site Scripting (XSS), garantizando la integridad de los datos.",
        "El sistema debe permitir la creación, edición y eliminación de perfiles de usuario, garantizando roles y permisos específicos para cada categoría de usuario.",
        "La aplicación debe encriptar todos los datos sensibles utilizando el estándar AES-256 y requerir autenticación de dos factores para el acceso administrativo.",
        "El sistema debe procesar solicitudes de usuario en menos de 1 segundo y mantener un tiempo de actividad del 99.9% mensual.",
        "La interfaz debe ser responsiva, adaptándose a dispositivos móviles y de escritorio, y permitir la personalización de temas por parte del usuario.",
        "El sistema debe integrarse con la API de pagos Stripe, permitiendo transacciones seguras y manejo automático de devoluciones en tiempo real.",
        "La plataforma debe soportar al menos 10,000 usuarios concurrentes sin degradar el rendimiento, asegurando una experiencia fluida para todos los usuarios.",
        "El sistema debe generar reportes financieros mensuales en formato PDF y Excel, con opciones de filtrado por rango de fechas y categorías de gasto.",
        "La aplicación debe implementar un sistema de notificaciones en tiempo real utilizando WebSockets, informando a los usuarios sobre actualizaciones importantes.",
        "El software debe ser compatible con los navegadores Chrome, Firefox, Safari y Edge en sus últimas dos versiones, garantizando una experiencia consistente.",
        "El sistema debe realizar copias de seguridad automáticas diarias de la base de datos, almacenándolas en un servidor seguro con redundancia geográfica.",
        "La aplicación debe permitir la importación y exportación de datos en formatos CSV y JSON, facilitando la integración con otras herramientas y sistemas.",
        "El sistema debe ofrecer una funcionalidad de búsqueda avanzada, permitiendo a los usuarios filtrar resultados por múltiples criterios simultáneamente.",
        "La plataforma debe incluir un panel de administración con acceso restringido, permitiendo a los administradores gestionar usuarios, permisos y configuraciones del sistema.",
        "El software debe soportar la localización en al menos cinco idiomas, incluyendo inglés, español, francés, alemán y portugués, facilitando su uso a nivel global.",
        "La aplicación debe implementar medidas de seguridad como protección contra ataques SQL Injection y Cross-Site Scripting (XSS), garantizando la integridad de los datos.",
        "El sistema debe permitir la integración con sistemas de terceros a través de API RESTful, facilitando la interoperabilidad con otras plataformas.",
        "La aplicación debe contar con un módulo de análisis de datos que genere estadísticas en tiempo real sobre el uso del sistema.",
        "El software debe soportar la autenticación mediante OAuth 2.0, permitiendo a los usuarios iniciar sesión con sus cuentas de redes sociales.",
        "El sistema debe registrar todas las acciones de los usuarios en un log seguro, permitiendo auditorías y seguimiento de actividades.",
        "La interfaz de usuario debe ser accesible según las pautas WCAG 2.1 nivel AA, asegurando accesibilidad para personas con discapacidades.",
        "El sistema debe manejar correctamente errores y excepciones, proporcionando mensajes de error claros y útiles para el usuario final.",
        "La aplicación debe permitir la configuración de alertas personalizadas basadas en eventos específicos definidos por el usuario.",
        "El sistema debe realizar pruebas de carga automáticas cada semana para asegurar que el rendimiento se mantiene bajo altos niveles de tráfico.",
        "La plataforma debe soportar la integración con servicios de mensajería como Slack y Microsoft Teams para facilitar la comunicación interna.",
        "El sistema debe ofrecer una API de búsqueda que permita a desarrolladores externos realizar consultas complejas sobre los datos almacenados.",
        "La aplicación debe incluir un tutorial interactivo para nuevos usuarios, guiándolos a través de las funcionalidades principales del sistema.",
        "El software debe permitir la exportación de datos históricos en formatos legibles para su análisis externo.",
        "El sistema debe soportar múltiples tipos de autenticación, incluyendo biométrica y de hardware, para mejorar la seguridad de acceso.",
        "La plataforma debe registrar y analizar el comportamiento del usuario para ofrecer recomendaciones personalizadas y mejorar la experiencia del usuario.",
        "El sistema debe proporcionar una interfaz de administración intuitiva que permita gestionar fácilmente configuraciones y usuarios sin necesidad de conocimientos técnicos avanzados."
    ]
}